//
//  main.swift
//  4
//
//  Created by Sergey Abrosov on 21.03.2024.
//

import Foundation

// императивный подход - четкие инструкции реализации
// декларативный подход - требуют описания конечного результата

// при постройке дома идут четкие инструкции - построить фундамент, первый этаж и тд
// постройте двух этажный дом с крышей и тд + описание тонкостей в конце

// в свифт юае на структурах все

// свит юай на основе юай кита -
// 1) насколько дольше работает?
// 2) есть ли кейсы в которых не получается что то сделать на свифт юае и приходится тянуть юай кит
// 3) что насчет переиспользуемости кода на других платформах tvOS / iPad и тд
// 4) как сочетается между собой в продуктовом проекте юай кит со свифт юаем и как свифт юай
// сочетается с обжс - адаптеры, юай не транслируется, бизнес логика через адаптеры
//
